{
  "chapters": [
    {
      "id": "ff_p1",
      "name": "A Letter to God",
      "book_content": "Characters: Lencho (a farmer), The Postmaster (a kind, fat, amiable man), Post-office employees. Summary: Lencho lives on the crest of a low hill in a valley. He anticipates rain for his corn fields, but a hailstorm occurs, destroying all crops. He views the big raindrops as 'ten cent pieces' and little ones as 'fives' before they turn to hail. Realizing his family will go hungry, he writes a letter to God asking for a hundred pesos. The postmaster, impressed by his faith, collects seventy pesos from employees and friends to help. Lencho, finding only seventy pesos, becomes angry and writes a second letter calling the post-office employees a 'bunch of crooks'.",
      "pyq_content": "Extract-based Questions: Why were there no leaves left on the trees? (Ans: Hailstorm). How did Lencho feel when he saw his destroyed corn fields? (Ans: Devastated/Soul filled with sadness). What did Lencho mean by 'All our work, for nothing'? (Ans: The loss of his entire crop harvest). Short/Long Answer Questions: Who read the letter sent by Lencho and what did he do?. Why would Lencho have preferred a plague of locusts to a hailstorm?. Explain the irony at the end of the chapter. Discuss Lencho’s unwavering faith in comparison with the role of faith in 'The Sermon at Benares'. Comment on the reactions of Lencho vs. Nelson Mandela when facing challenges."
    },
    {
      "id": "ff_p2",
      "name": "Nelson Mandela: Long Walk to Freedom",
      "book_content": "Characters: Nelson Rolihlahla Mandela, Zenani (his daughter), Mr. de Klerk, Thabo Mbeki. Summary: On 10th May, Mandela is inaugurated as South Africa's first Black president at the Union Buildings in Pretoria. He reflects on the 'policy of apartheid' which created a 'deep and lasting wound'. He defines a brave man not as one who does not feel afraid, but one who conquers that fear. He discusses the transition from white supremacy to a democratic, non-racial government and pledges to liberate his people from the bondage of poverty and discrimination.",
      "pyq_content": "Short/Long Answer Questions: Explain the significance of the word 'wound' as used by Mandela regarding apartheid. How did Mandela learn the meaning of courage?. Why was it important to learn to hate, according to Mandela?. Why did Mandela feel liberation was important for both the oppressor and the oppressed?. Elaborate on how the transition in South Africa reflects broader historical trends in human rights. Examine themes of transformation and liberation shared with the poem 'The Trees'."
    },
    {
      "id": "ff_p3",
      "name": "Two Stories about Flying",
      "book_content": "Characters: The Young Seagull, his parents, and siblings; The Pilot (narrator of Black Aeroplane). Summary: Part I: A young seagull is afraid to fly while his siblings have already succeeded. His mother uses a piece of fish to tempt him into his first flight. Part II: A pilot flying an old Dakota toward England gets caught in a black storm. He is rescued by a mysterious black aeroplane without lights. Upon landing, he discovers from the control center that no other planes were in the sky.",
      "pyq_content": "Short/Long Answer Questions: What strategy did the mother adopt to teach the seagull to fly?. Why was the young seagull afraid to fly and how did his parents' reactions contribute to this?. Why was the narrator not sorry to walk away from the old Dakota?. Who does the narrator think helped him reach safety?. Evaluate the role of faith for the Young Seagull compared to Lencho."
    },
    {
      "id": "ff_p4",
      "name": "From the Diary of Anne Frank",
      "book_content": "Characters: Anne Frank, Mr. Keesing (Maths teacher), Sanne (friend), Margot (sister). Summary: Anne considers paper to have 'more patience than people'. Feeling alone despite having thirty 'friends' and a loving family, she starts a diary named 'Kitty' to be her true confidante. She describes her school life, specifically being punished by Mr. Keesing for being a 'chatterbox'. She eventually wins him over by writing a humorous poem about a father swan who bites his ducklings for quacking too much.",
      "pyq_content": "Extract-based Questions: Why does Anne feel she is not 'completely alone'? (Ans: Has family/friends but lacks a true confidante). Complete the analogy: alone : friends : : nothing : (Ans: everything). What can we infer about Anne's emotional state? (Ans: Depressed/lonely). Short/Long Answer Questions: How did Anne justify being a chatterbox in her essay?. Why did Mr. Keesing allow Anne to talk in class?. Compare the resilience of Anne Frank with Valli from 'Madam Rides the Bus'."
    },
    {
      "id": "ff_p5",
      "name": "Glimpses of India",
      "book_content": "Characters: The Pader (Goan baker), The Kodavus (Coorg people), Pranjol, Rajvir, Mr. Barua. Summary: I. A Baker from Goa: Traditional bakers are essential to Goan village life. They wear a 'kabai' and are known as 'pader'. II. Coorg: A 'piece of heaven' between Mysore and Mangalore, known for its brave martial people (Kodavus), coffee, and rainforests. III. Tea from Assam: Rajvir and Pranjol travel to Assam; Rajvir shares legends about the origin of tea (Chinese and Indian). They visit Dhekiabari Tea Estate.",
      "pyq_content": "Short/Long Answer Questions: What did Pranjol and Rajvir do during the journey?. Write two characteristics of the people of Coorg. Why is Coorg called the land of rolling hills?. How did the baker herald his arrival in the morning?. Explain why the baker was a friend, companion, and guide. What were the Indian/Chinese legends about the origin of tea?. Why does the author refer to Coorg as the 'kingdom of heaven'?. Compare the childhood of a baker in Goa to that of Nelson Mandela."
    },
    {
      "id": "ff_p6",
      "name": "Mijbil the Otter",
      "book_content": "Characters: Gavin Maxwell (narrator), Mijbil (the otter). Summary: Maxwell decides to keep an otter as a pet in Iraq. He names the species 'Maxwell's Otter'. Mijbil is initially aloof but soon becomes playful, especially in water. Transporting Mij to London involves a nightmare incident where Mij damages his box and escapes on the airplane, eventually being found at Maxwell's feet. In London, Mij invents a game with a ping-pong ball and a damaged suitcase.",
      "pyq_content": "Extract-based Questions: Why did Mijbil sleep on the floor far from the bed initially? (Ans: Aloof/Indifferent). Which characteristic trait is revealed when Mij is in the bathroom? (Ans: Playfulness/love for water). Short/Long Answer Questions: How was Mij transported to England and why was it a nightmare?. Describe Mij's 'compulsive habits'. Elaborate on the fact that owning a pet is a life of commitment. Justify that the instinct for freedom is fundamental using Mij and the Tiger."
    },
    {
      "id": "ff_p7",
      "name": "Madam Rides the Bus",
      "book_content": "Characters: Valli (Valliammai - an eight-year-old girl), The Bus Conductor. Summary: Valli's favorite pastime is watching the street from her doorway. Her deepest desire is to ride the bus to the town. She meticulously saves sixty paise for the fare and plans the journey. During the ride, she is fascinated by the scenery but saddened on the return journey by the sight of a dead cow she had seen alive earlier. This experience serves as her initiation into the mystery of life and death.",
      "pyq_content": "Short/Long Answer Questions: What did Valli have to do to go and ride in a bus?. Justify that Valli was a mature girl ahead of her age. Why was Valli's excitement dampened on her return journey?. Explain how Valli's journey served as her initiation into the mysteries of life and death. Compare Valli's longing for freedom with Amanda's. Discuss the role of curiosity vs. fear/self-doubt in Valli's success."
    },
    {
      "id": "ff_p8",
      "name": "The Sermon at Benares",
      "book_content": "Characters: Gautama Buddha, Kisa Gotami. Summary: Prince Siddhartha leaves his life of luxury to seek enlightenment after witnessing suffering. He becomes the Buddha and delivers his first sermon at Benares. Kisa Gotami, grieving her dead son, is told by Buddha to find mustard seeds from a house where no one has died. She fails, realizing that death is universal and common to all. Buddha teaches that the world is afflicted with death and decay, and peace of mind comes through overcoming lamentation.",
      "pyq_content": "Short/Long Answer Questions: How, according to Buddha, can one obtain peace of mind?. What did Buddha try to preach to the common man through Kisa Gotami?. Why did Kisa Gotami become weary and hopeless?. Discuss the theme of loss in this chapter compared to 'The Ball Poem'. Justify that grief is a measure of love in response to the sermon. Evaluate the role of faith compared to 'A Letter to God'."
    },
    {
      "id": "ff_p9",
      "name": "The Proposal",
      "book_content": "Characters: Stepan Stepanovitch Chubukov (landowner), Natalya Stepanovna (his daughter), Ivan Vassilevitch Lomov (neighbor). Summary: Lomov comes to propose to Natalya but the conversation repeatedly devolves into arguments over land ownership (Oxen Meadows) and the superiority of their hunting dogs (Guess vs. Squeezer). Despite the insults and Lomov's palpitations, the proposal is eventually accepted after Chubukov intervenes, though the arguing continue.",
      "pyq_content": "Short/Long Answer Questions: Write a brief character sketch of Lomov. What was the objective of Lomov's visit?. Why did Chubukov misunderstand the purpose of Lomov's visit?. Discuss how the writer uses language to create humor in this play. Support the idea that Russian society emerges as a character in the play. Explain what the line 'what a burden... to be the father of a grown-up daughter' conveys about Chubukov. Describe the argument over the dogs."
    },
    {
      "id": "ff_po1",
      "name": "Dust of Snow",
      "book_content": "Poet: Robert Frost. Summary: A simple action where a crow shakes snow from a hemlock tree onto the poet changes his mood from regretful to positive, saving the rest of his day.",
      "pyq_content": "Short/Long Answer Questions: What changes the mood of the poet in this poem?. Elaborate on how the hemlock tree and crow hold specific meanings. How does Frost present the power of nature?. Compare the role of Nature here with the poem 'Fog'."
    },
    {
      "id": "ff_po2",
      "name": "Fire and Ice",
      "book_content": "Poet: Robert Frost. Summary: The poet explores two theories for the end of the world: fire (desire/passion) and ice (hatred/indifference).",
      "pyq_content": "Extract-based Questions: What is the prediction of the poet about how the world will end?. Short/Long Answer Questions: Justify Frost's view of nature changes when compared to 'Dust of Snow'."
    },
    {
      "id": "ff_po3",
      "name": "A Tiger in the Zoo",
      "book_content": "Poet: Leslie Norris. Summary: The poem contrasts a tiger's life in a concrete zoo cell, where he is restricted to a few steps and ignores visitors, with his natural life in the wild, lurking in shadows to hunt deer near water holes.",
      "pyq_content": "Extract-based Questions: What do the 'vivid stripes' refer to? (Ans: Tiger's skin). Why was the tiger lurking in shadow? (Ans: To catch its prey). Short/Long Answer Questions: Why does the tiger in the zoo ignore visitors?. Contrast the portrayal of the tiger here with 'How to Tell Wild Animals'. Is it ethical to enclose wild animals in cages?."
    },
    {
      "id": "ff_po4",
      "name": "How to Tell Wild Animals",
      "book_content": "Poet: Carolyn Wells. Summary: A humorous guide on identifying wild animals like the Asian Lion, Bengal Tiger, Leopard, Bear, Hyena, Crocodile, and Chameleon based on their dangerous traits.",
      "pyq_content": "Extract-based Questions: How can a crocodile be told from a hyena? (Ans: Hyenas smile, crocodiles weep). What does 'A novice might nonplus' mean? (Ans: A beginner might be confused). Short/Long Answer Questions: Why is the term 'bear hug' ironical?. Discuss the contrast with 'A Tiger in the Zoo'."
    },
    {
      "id": "ff_po5",
      "name": "The Ball Poem",
      "book_content": "Poet: John Berryman. Summary: A boy loses his ball in the harbor. The poet realizes that money is 'external' and cannot replace the memories attached to the ball. The boy learns the 'epistemology of loss' and how to stand up in a world of possessions.",
      "pyq_content": "Short/Long Answer Questions: How is the loss of the ball a lesson to the boy?. What does the poet mean by 'no one buys a ball back'?. Discuss how this poem deals with the undertones of loss and responsibility. Compare the theme of loss here with 'The Sermon at Benares'."
    },
    {
      "id": "ff_po6",
      "name": "Amanda!",
      "book_content": "Poet: Robin Klein. Summary: Amanda is constantly nagged by her mother to sit up straight, finish homework, and clean her room. She escapes into fantasies of being a mermaid, an orphan, or Rapunzel to find silence and freedom.",
      "pyq_content": "Extract-based Questions: How does the poet reinforce the contrast between the narrator's instructions and Amanda's desires?. Why does Amanda imagine herself to be Rapunzel?. Short/Long Answer Questions: Explain Amanda's yearning for freedom. Describe the imagery of the emerald sea."
    },
    {
      "id": "ff_po7",
      "name": "The Trees",
      "book_content": "Poet: Adrienne Rich. Summary: Trees are described as moving from houses toward the forest. The movement is metaphorical for the conflict between man and nature and the struggle for liberation.",
      "pyq_content": "Extract-based Questions: Why does the poet describe the bough as 'shuffling'? (Ans: To show restricted movement or a sense of unease). What atmosphere is created by the imagery? (Ans: Melancholic/Traumatic). Short/Long Answer Questions: Discuss how the poem presents the conflict between man and nature."
    },
    {
      "id": "ff_po8",
      "name": "Fog",
      "book_content": "Poet: Carl Sandburg. Summary: A short poem comparing fog to a cat that arrives silently 'on little cat feet' and looks over the city.",
      "pyq_content": "Short/Long Answer Questions: What does Sandburg think the fog is like?. Highlight the significance of the metaphor employed. Compare the role of Nature here with 'Dust of Snow'."
    },
    {
      "id": "ff_po9",
      "name": "The Tale of Custard the Dragon",
      "book_content": "Poet: Ogden Nash. Summary: Belinda has four pets: Ink (cat), Blink (mouse), Mustard (dog), and Custard (dragon). While the others claim to be brave, Custard is a 'coward' who wants a safe cage. When a pirate attacks, the brave pets flee, but Custard eats him. Afterward, the others go back to boasting.",
      "pyq_content": "Short/Long Answer Questions: How does this poem differ from a traditional ballad?. Describe Custard the dragon. Why is Custard referred to as Percival?. How does Ogden Nash create humor and entertainment?. Discuss the contrast reflected in the last two lines of the extract. Describe the pirate."
    },
    {
      "id": "ff_po10",
      "name": "For Anne Gregory",
      "book_content": "Poet: W.B. Yeats. Summary: A conversation about love where a young man claims to love Anne for her yellow hair, but a text found by an old man proves only God can love a person for themselves alone.",
      "pyq_content": "Extract-based Questions: Why does the speaker address her as 'my dear'?. What is the significance of 'yellow hair'?. Short/Long Answer Questions: Discuss the concept of beauty and inner love. Comment on the idea that inner beauty is what matters."
    },
    {
      "id": "fp_p1",
      "name": "A Triumph of Surgery",
      "book_content": "Characters: Tricki (the dog), Mrs. Pumphrey (rich owner), James Herriot (Vet), Chauffeur. Summary: Tricki is overfed by Mrs. Pumphrey and becomes 'hugely fat' like a 'bloated sausage'. Herriot hospitalized the dog, giving it only water for two days. Tricki recovers through interaction with other dogs and exercise. Mrs. Pumphrey, seeing the healthy Tricki, calls it a 'triumph of surgery'.",
      "pyq_content": "Short/Long Answer Questions: Why did the author make plans for Tricki in advance?. Analyze how the relationship between Tricki and Mrs. Pumphrey reflects societal attitudes toward pets. Characterize Mrs. Pumphrey based on her being distraught. Why did Mrs. Pumphrey think the dog's recovery was a 'triumph of surgery'?. Do you think such individuals are merely foolish or cause harm?."
    },
    {
      "id": "fp_p2",
      "name": "The Thief’s Story",
      "book_content": "Characters: Anil (writer), Hari Singh (15-year-old thief). Summary: Hari Singh befriends Anil to rob him. Anil teaches Hari to cook and write. Hari steals Anil's money but cannot bring himself to leave on the Lucknow Express because of his conscience and Anil's trust. He returns the money, finding it damp from rain. Anil knows about the theft but forgives Hari silently, promising him regular pay and further education.",
      "pyq_content": "Extract-based Questions: What does Anil promise to teach Hari? (Ans: To cook, write name, full sentences, add numbers). Realization Hari had while working for Anil? (Ans: Education could help him accomplish more). Short/Long Answer Questions: Why does Anil not hand over Hari Singh to the police?. How did Anil's forgiveness and acceptance transform the thief?. Why did Hari Singh lie about knowing how to cook?. Discuss the theme of human values and relations through Hari's diary entry."
    },
    {
      "id": "fp_p3",
      "name": "The Midnight Visitor",
      "book_content": "Characters: Ausable (secret agent), Max (intruder), Fowler (writer). Summary: Fowler is disappointed by Ausable's fat, non-mysterious appearance. Max enters Ausable's room with a gun to steal a report on new missiles. Ausable outwits Max by inventing a story about a non-existent balcony under the window. When there is a knock at the door, Ausable claims it is the police. Max jumps out the window to the 'balcony' and falls to his death.",
      "pyq_content": "Short/Long Answer Questions: How did Ausable get rid of Max?. Why was Fowler disappointed initially?. Explain the lesson 'one should never judge a book by its cover' using Ausable. Describe Ausable's fabricated tale regarding the balcony."
    },
    {
      "id": "fp_p4",
      "name": "A Question of Trust",
      "book_content": "Characters: Horace Danby (thief), The Lady in Red (a smarter thief). Summary: Horace Danby, who steals once a year to buy rare books, attempts to rob a safe at Shotover Grange. He is interrupted by a young woman in red who pretends to be the mistress of the house. She tricks him into opening the safe for her without his gloves. Horace is later arrested when his fingerprints are found on the safe.",
      "pyq_content": "Short/Long Answer Questions: How did the lady in red manage to outsmart Horace Danby?. Was Horace's own foolishness responsible for his arrest?. Explain why Horace was mistakenly accused and caught. Do intentions justify actions?."
    },
    {
      "id": "fp_p5",
      "name": "Footprints without Feet",
      "book_content": "Characters: Griffin (scientist), Mrs. Hall (innkeeper), Mr. Jaffers (constable). Summary: Griffin discovers a way to become invisible but uses it for criminal activities [196, 201]. He takes shelter at an inn in Iping, appearing eccentric with bandages on his face [68, 202]. He robs a clergyman and causes a disturbance at the inn [202, 203]. When the constable tries to arrest him, Griffin removes his clothes to become invisible and escapes [204, 205].",
      "pyq_content": "Short/Long Answer Questions: Why was Griffin considered a lawless person? [28, 35, 85-88, 183, 206]. Assess Griffin as a scientist [206]. Discuss the character development of Griffin as his abilities become a burden [85-87]. How did Griffin first become visible? [196]. Describe the character arc of Griffin as a brilliant scientist who degenerates into a lawless wanderer [36, 207-209]."
    },
    {
      "id": "fp_p6",
      "name": "The Making of a Scientist",
      "book_content": "Characters: Richard Ebright, his mother, Dr. Urquhart, Mr. Weiherer (teacher). Summary: The story traces Ebright's journey into science, sparked by his collection of butterflies [210]. His mother supports his curiosity by buying him equipment and the book 'The Travels of Monarch X' [210, 211]. Ebright wins a science fair with experiments on monarch pupae gold spots, discovering a new hormone [211]. He eventually develops a theory on the life of cells [212].",
      "pyq_content": "Short/Long Answer Questions: What are the essential qualities for becoming a scientist according to Ebright? [93-95]. What role did Ebright's mother play in his success? [97, 108, 156, 213, 214]. How did the book 'The Travels of Monarch X' become a turning point in his life? [28, 90, 211, 215]. What did Ebright learn from his failure at the Science fair? [157]. Discuss how his curiosity drove him to become a scientist [37, 200, 216]."
    },
    {
      "id": "fp_p7",
      "name": "The Necklace",
      "book_content": "Characters: Matilda Loisel, M. Loisel (husband), Mme Forestier (friend). Summary: Matilda, unhappy with her simple life, borrows a diamond necklace for a ball [217, 218]. She loses the necklace and spends ten years in extreme poverty to repay the debt for a replacement [219, 220]. She eventually discovers the original was fake and worth very little [221].",
      "pyq_content": "Short/Long Answer Questions: Elaborate how Matilda's dissatisfaction led to her ruin [32, 96, 199, 222-224]. Trace the transformation of Matilda's character [199, 207, 225, 226]. How did the necklace change the life of the Loisels? [99, 110, 156, 197]. Why did Matilda depart hastily from the ball? [190, 191, 227]. What was the 'twist' at the end of the story? [19, 59, 198]. Did you sympathise with Matilda? [56, 109]."
    },
    {
      "id": "fp_p8",
      "name": "Bholi",
      "book_content": "Characters: Sulekha (Bholi), Ramlal (father), Bholi's Teacher, Bishamber (groom). Summary: Sulekha, neglected and teased for her stammer and pock-marks, is sent to school [228]. A kind teacher encourages her to overcome her fear [228, 229]. When the greedy Bishamber demands a dowry, an educated Bholi refuses to marry him, deciding to take care of her parents instead [75, 223, 230, 231].",
      "pyq_content": "Short/Long Answer Questions: How did education transform Bholi? [18, 32, 75, 84, 89, 117, 126, 223, 230]. Discuss Bholi's evolution into a role model for village girls [108, 110, 156, 232, 233]. Why was Bholi sent to school for an uncommon reason? [28]. Imagine Bholi writing a diary entry about her refusal to marry Bishamber [84, 89, 126, 232, 233]. Explain the teacher's role as a pillar of support [49, 117, 118]."
    },
    {
      "id": "fp_p9",
      "name": "The Book That Saved the Earth",
      "book_content": "Characters: Think-Tank (Commander-in-Chief), Noodle, Omega, Iota, Oop, Historian. Summary: Set in the 25th century, a historian narrates how a book of nursery rhymes ('Mother Goose') saved Earth from a Martian invasion in 2040 [234, 235]. Think-Tank misinterprets the rhymes as threats; he thinks the line 'Humpty Dumpty had a great fall' refers to his own destruction [236]. Terrified, he cancels the invasion and flees to Alpha Centauri [236, 237].",
      "pyq_content": "Short/Long Answer Questions: How was earth saved by a 'Book'? [85-87]. In what ways does Think-Tank misinterpret nursery rhymes as threats? [96, 182, 238]. How did Noodle handle Think-Tank's mistakes without offending him? [239]. Explain the statement 'half-baked knowledge is always dangerous' using Think-Tank [35]. Why was the 20th century called the 'Era of the Book'? [235]."
    }
  ]
}